[
    {
        "image_url": "https://photos.zillowstatic.com/fp/9dd85867abf59605dd66c4f683978e7e-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/1642-dekalb-avenue-brooklyn/3r",
        "description": "Welcome to your new home in the heart of Bushwick, Brooklyn! This charming two-bedroom apartment is located on the third floor of a classic walk-up building. The apartment boasts a spacious layout with plenty of natural light, creating a warm and inviting atmosphere. The bedrooms are well-proportioned, offering ample closet space and comfort. The kitchen is large, perfect for cooking and entertaining. The living area is ideal for relaxing after a long day. Conveniently located close to the L train, you’ll be just a quick 15-minute ride away from the city, making your daily commute a breeze. <br/><br/>Enjoy the vibrant neighborhood filled with trendy cafes, restaurants, and shops, all within walking distance. Please note that income and credit will be verified, and a broker fee applies. Don’t miss out on this opportunity to make this beautiful apartment your new home!",
        "bathrooms": 1,
        "bedrooms": 2,
        "price": 1700,
        "address": "1642 Dekalb Avenue #3R, Brooklyn, NY",
        "neighborhood": "Bushwick",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/8003d2aed893d2037b4b073b85f0b48f-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/400-cathedral-parkway-new_york/94",
        "description": "Upper West Side pre-war doorman elevator building. This superb high floor 3 bedrooms apartment gets great natural light, has city street views and Morningside Park views. The apartment has a separate windowed kitchen fully equipped plus a dishwasher & microwave. 2 bedrooms with closet in each. Beautiful hardwood floors and great closet space throughout the apartment. Charming white tiled bathroom.Pets are welcome. Residents enjoy a 24-hour doorman, live-in superintendent, laundry room and bike storage. Located on a beautiful 110th street, steps to Central, Morningside and Riverside Parks. Easy access to grocery stores, boutiques shops and restaurant dining. Few steps to 1,B,C trains.",
        "bathrooms": 1,
        "bedrooms": 3,
        "price": 5750,
        "address": "410 Cathedral Parkway #94, New York, NY",
        "neighborhood": "Upper West Side",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/d6ebf63ceccf73385afd772a78ae32da-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/218-thompson-street-new_york/31",
        "description": "Upper West Side pre-war doorman elevator building. This superb high floor 3 bedrooms apartment gets great natural light, has city street views and Morningside Park views. The apartment has a separate windowed kitchen fully equipped plus a dishwasher & microwave. 2 bedrooms with closet in each. Beautiful hardwood floors and great closet space throughout the apartment. Charming white tiled bathroom.Pets are welcome. Residents enjoy a 24-hour doorman, live-in superintendent, laundry room and bike storage. Located on a beautiful 110th street, steps to Central, Morningside and Riverside Parks. Easy access to grocery stores, boutiques shops and restaurant dining. Few steps to 1,B,C trains.",
        "bathrooms": 1,
        "bedrooms": 2,
        "price": 3395,
        "address": "218 Thompson Street #31, New York, NY",
        "neighborhood": "Greenwich Village",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/9424d8cf93c54e139cc9280021e44226-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/650-union-street-brooklyn/3",
        "description": "Amazing 3 bed / 2 bath with private roof deck!",
        "bathrooms": 2,
        "bedrooms": 3,
        "price": 5200,
        "address": "650 Union Street #3, Brooklyn, NY",
        "neighborhood": "Park Slope",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/9d12d0673c4c30861cdf2eb9360dd521-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/100-maiden-lane-new_york/2107?featured=1",
        "description": "Updated Unit w/ Renovated Hardwood Floors <br/ > Studio w/ Large Private Terrace, Pass-Thru Kitchen, Stainless Steel Appliances, Granite Counter Tops, Wood Cabinets, Hardwood Floors, Marble Bathroom, South Exposure <br/>FOR ADDITIONAL AVAILABILITY PLEASE GO TO OUR WEBSITE<br/>LEASING OFFICE HOURS: MON-SAT 10 AM - 6 PM (CLOSED SUNDAY)<br/>TO BOOK AN APPOINTMENT PLEASE GO TO OUR WEBSITE<br/>Converted from a 25-story Art Deco office building, 100 Maiden Lane brings a rich blend of traditional architecture and modern lifestyle amenities. The building features a 24-hour attended lobby, an on-site parking garage, a new fitness center, and a gorgeous landscaped sundeck. Conveniently located at the intersection of Maiden Lane and Pearl Street and close to all transportation (2, 3, 4, 5, A, C, J, M, Z, N, R, Water Taxi, NJ Path, Staten Island Ferry, NJ Waterway), you'll never have to worry about your commute again",
        "bathrooms": 1,
        "bedrooms": 0,
        "price": 3595,
        "address": "100 Maiden Lane #2107, New York, NY",
        "neighborhood": "Financial District",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/91d9071dc6f454b83a796a7ec725218b-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/388-clinton-avenue-brooklyn/2",
        "description": "This home is truly breathtaking. Rarely do homes come on the rental market with this amount of space and with this quality of renovation. With over 2,700 square feet, this pre-war home is the top three floors and rooftop terrace of a three family home.",
        "bathrooms": 3.5,
        "bedrooms": 5,
        "price": 12950,
        "address": "388 Clinton Avenue #2, Brooklyn, NY",
        "neighborhood": "Clinton Hill",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/c96d272e03f899bbfbe451a641ccc85c-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/388-clinton-avenue-brooklyn/2",
        "description": "One of the very few industrial textile factory loft buildings that were converted into beautiful, spacious, high ceiling apartments that kept their original touch. All the apartments are cozy, cool and comfy!<br/>This beautifully newly renovated 2 bed duplex has 2 large bedrooms and 2 bathrooms. The high ceilings and huge windows give the space all the lighting you need, a large renovated corner kitchen with full size appliances, and hardwood floors.<br/><br/>Amenities include: Washer/dryer in building Live in Super Secure Package Room Key FOB entry Industrial style building, factory converted lofts Magnificent, large rooftop with city views for days and lots of room for cool, funky parties, Grills and lazy lounging ;) Artists/Musicians hotspot. Large elevator for convenient move in",
        "bathrooms": 3.5,
        "bedrooms": 5,
        "price": 12950,
        "address": "248 Mc Kibben Street #1E, Brooklyn, NY",
        "neighborhood": "Clinton Hill",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/3b9f9aa766a0ded98fa78ebd410e79d0-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/37-driggs-avenue-brooklyn/2f?featured=1",
        "description": "No Fee! Large 2 bedroom, 2 bathroom with en-suite Washer Dryer at newly developed Sutton Lofts in prime Greenpoint. <br/>Sutton Lofts was designed by architect Michael Tersigni. This residence offers wide oak flooring, open concept living rooms with tall ceilings and natural light, Bertazzoni appliances in the kitchen including a dishwasher, led lighting, deep soak tubs with rainfall showers, and a Washer/Dryer in unit. The living room offers ample space for a sofa and enough room for a desk and dining room table. With one en-suite bathroom and one in the common area, your guest or roommate can enjoy optimal privacy.",
        "bathrooms": 2,
        "bedrooms": 2,
        "price": 4095,
        "address": "37 Driggs Avenue #2F, Brooklyn, NY",
        "neighborhood": "Greenpoint",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/3c2b05fa09c8156450dff3a1cc7b40b0-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/towne-house/310",
        "description": "huge convertible 2 bed with wall already installed footsteps from Grand Central!!! Building offers 24/7 doorman elevators, package room, laundry in building, live in super, and free access to gym",
        "bathrooms": 1,
        "bedrooms": 1,
        "price": 4500,
        "address": "108 East 38th Street #310, New York, NY",
        "neighborhood": "Murray Hill",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/28331e1c9a6eacdad2582146a7bfb558-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/1722-amsterdam-avenue-new_york/1r",
        "description": "1722 Amsterdam Avenue - A 4 Bedroom Delight! Dreaming of spacious living in Hamilton Heights? Look no further! Authentic Four Bedrooms: Roomy and versatile, each fit for a queen or full-sized bed. Prime Location: Just a short, pleasant walk to the subway. Mobile Rent Payments: Experience an easy online payment method. Sunlit Spaces: Thanks to large windows that fill the apartment with natural light. Hardwood Flooring: Add character and warmth throughout the apartment. Dream Kitchen: Full-sized appliances - built for functionality and style.",
        "bathrooms": 1.5,
        "bedrooms": 4,
        "price": 2900,
        "address": "1722 Amsterdam Avenue #1R, New York, NY",
        "neighborhood": "Hamilton Heights",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/db949c4299dac31dc7c618dacef6f303-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/101-bruckner-boulevard-bronx/7r",
        "description": "1 Bed / 1 Bath at 101 Bruckner Blvd - Unit: 2f in Port Morris, Bronx. Pets Upon Approval. Nearby subway stations include: Brook Av (6).30 mins from Grand Central & 90 minutes from the Catskills! Parking, as well as full roof with grills & Manhattan skyline view. Gym, lounge, co-working, screening room, yoga studio, podcast studio and party room included. Full LG 24 inch washer & dryer, kitchen island, high-end Blomberg microwave & 18 inch dishwasher. Marble countertops, split unit A/C & 10-foot ceilings. Close to Alexander Ave Open street & so many cafes & restaurants!",
        "bathrooms": 1,
        "bedrooms": 1,
        "price": 2607,
        "address": "101 Bruckner Boulevard #7R, New York, NY",
        "neighborhood": "Mott Haven",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/5fef6ed45004bb7032959ded8e198517-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/388-bridge-street-brooklyn/8d",
        "description": "388 Bridge offers panoramic vistas of nearly all of New York City's landmarks. Providing the highest level of amenities, 388 Bridge offers a grand fully-attended lobby and a rooftop viewing terrace. Common spaces include a Lounge /Party Room, Gym, Kids Room, and 5th Floor Outdoor Terrace with BBQ grilling deck and separate children's playground. Positioned in the heart of downtown Brooklyn, the area is a nexus of culture, commerce, and recreation. Adjacent neighborhoods like Brooklyn Heights, Boerum Hill, Cobble Hill, Fort Greene, and Dumbo await exploration.",
        "bathrooms": 1,
        "bedrooms": 0,
        "price": 3350,
        "address": "388 Bridge Street #8D, Brooklyn, NY",
        "neighborhood": "Downtown Brooklyn",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/d823418bebc85a937fb0547dd4d581ec-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/515-east-88-street-new_york/3g",
        "description": "real 1 bedroom with south sun in one of the Upper East Sides premier coop buildings fully renovated kitchen and bathroom with high end finishes this unit has lots of closets including a large walk in closet in the bedroom separate kitchen with window - has a bar to eat at and stainless steel appliances the building has an elevator, laundry room, live in super, package area, and bike room and stones throws to the Q, 4,5,6 trains as well as busses and the fabulous Carl Shurz park with a gorgeous boardwalk and river views! This building has one of the best management and live in superintendents on the upper east side! a truly wonderful place to live for many years!",
        "bathrooms": 1,
        "bedrooms": 1,
        "price": 3200,
        "address": "515 East 88th Street #3G, New York, NY",
        "neighborhood": "Yorkville",
        "likability": 0,
        "applyLikelihood": 0
    },
    {
        "image_url": "https://photos.zillowstatic.com/fp/a920c8ca3086eb86f64020129e461589-se_large_800_400.webp",
        "url": "https://streeteasy.com/building/304-west-89-street-new_york/8d",
        "description": "Furnished only! Welcome to 8D at 304 W 89th Street, a stunning residence completely custom renovated with the utmost attention to detail. This beautifully furnished and professionally designed home seamlessly blends pre-war charm with modern design, featuring bespoke details throughout. Every room is graced with a window, allowing abundant natural light. This gracious one-bedroom home offers high ceilings, hardwood flooring, and custom closets for ample storage, while the thoughtfully designed layout provides both style and functionality. The separate kitchen is a chef's dream, equipped with brand-new finishes, top-of-the-line Monogram appliance package, ample counter space, and custom-built cabinetry. A bright and windowed spa-like bathroom offers standing shower and features a large linen closet. Situated in a meticulously maintained pre-war building designed by renowned architect Rosario Candela, this intimate Upper West Side co-op offers an elevator, laundry room, live-in superintendent, and video intercom system. Apartment 8D blends convenience with luxury, providing an exceptional experience of both classic and contemporary living. The location of 304 W 89th Street is unparalleled, nestled in the heart of Manhattan's Upper West Side. This vibrant neighborhood offers a perfect blend of cultural richness, convenience, and charm. Residents enjoy close proximity to Riverside Park and Central Park, providing ample opportunities for outdoor activities and relaxation. The area is also renowned for its diverse dining options, boutique shops, and museums, making it an ideal place for those looking to immerse themselves in the best of NYC has to offer!",
        "bathrooms": 1,
        "bedrooms": 1,
        "price": 5995,
        "address": "304 West 89th Street #8D, New York, NY",
        "neighborhood": "Upper West Side",
        "likability": 0,
        "applyLikelihood": 0
    }
]